<!-- runners-poc:plan:pr-1-352cb9a -->
Managed Runners (OpenTofu) Plan

ZIJ/test-runners-poc @ 352cb9a51c6276422f024f291daf2176be8f6396

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_storage_bucket.test will be created
  + resource "google_storage_bucket" "test" {
      + effective_labels            = {
          + "env"                        = "test"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "opentofu"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "env"        = "test"
          + "managed_by" = "opentofu"
        }
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "test"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "opentofu"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)
    }

  # random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)
  + bucket_url  = (known after apply)
```
